# DSelectObj

## Description
Deselects all objects which match the search criteria.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE DSelectObj(c : CRITERIA);
```

```python

def vs.DSelectObj(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
```pascal
DSelectObj(S='Pine Tree');

{deselects all 'Pine Tree' symbols}
```

## Version
Availability: from MiniCAD
## Category
* Criteria